art_share/app/controllers/comments_controller.rb

    def index
        @comments = User.find(params[:user_id]).comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]