art_share/app/controllers/users_controller.rb

    def index
        if(params[:query])
            @users = User.where('username iLIKE (?)', '%' + params[:query] + '%' )
        else
            @users = User.all
---
SELECT "users".* FROM "users" WHERE (username iLIKE ('%jo%'))
SELECT "users".* FROM "users"